
export interface Event {
    description: string;
    isHoliday?: boolean;
}

// Month Name -> Day Number -> Array of Events
export const EVENTS_BY_MONTH: { [key: string]: { [key: number]: Event[] } } = {
    'فروردین': {
        1: [
            { description: 'جشن نوروز/جشن سال نو', isHoliday: true },
            { description: 'عید سعید فطر [ ١ شوال ]', isHoliday: true },
            { description: 'روز جهانی نوروز [ March 21 ]' }
        ],
        2: [
            { description: 'عید نوروز', isHoliday: true },
            { description: 'تعطیل به مناسبت عید سعید فطر [ ٢ شوال ]', isHoliday: true }
        ],
        3: [
            { description: 'عید نوروز', isHoliday: true },
            { description: 'روز جهانی هواشناسی [ March 23 ]' }
        ],
        4: [
            { description: 'عید نوروز', isHoliday: true }
        ],
        6: [
            { description: 'روز امید، روز شادباش نویسی' },
            { description: 'زادروز اشو زرتشت، آبرسان بزرگ تاریخ' }
        ],
        7: [{ description: 'روز جهانی تئاتر [ March 27 ]' }],
        10: [{ description: 'جشن آبانگاه' }],
        12: [{ description: 'روز جمهوری اسلامی', isHoliday: true }],
        13: [{ description: 'جشن سیزده به در', isHoliday: true }],
        17: [{ description: 'روز جهانی جشن سروشگان' }],
        18: [{ description: 'روز جهانی بهداشت [ April 7 ]' }],
        19: [{ description: 'فروردین روز، جشن فروردینگان' }],
        23: [{ description: 'روز دندانپزشک' }],
        25: [
            { description: 'روز بزرگداشت عطار نیشابوری' },
            { description: 'شهادت امام جعفر صادق (ع) [ ٢٥ شوال ]', isHoliday: true }
        ],
        29: [{ description: 'روز ارتش جمهوری اسلامی ایران' }],
        30: [
            { description: 'ولادت حضرت معصومه (س)، روز دختران [ ١ ذوالقعده ]' },
            { description: 'روز علوم آزمایشگاهی، زاد روز حکیم سید اسماعیل جرجانی' }
        ],
    },
    'اردیبهشت': {
        1: [{ description: 'روز بزرگداشت سعدی' }],
        2: [{ description: 'جشن گیاه آوری؛ روز زمین [ April 22 ]' }],
        3: [{ description: 'روز بزرگداشت شیخ بهایی؛ روز ملی کارآفرینی؛ روز معماری' }],
        6: [{ description: 'فاجعه ی انفجار بندر عباس [۱۴۰۴ خورشیدی]' }],
        7: [{ description: 'روز جهانی طراحی و گرافیک [ April 27 ]' }],
        9: [
            { description: 'ولادت امام رضا (ع) [ ۱۱ ذوالقعده ]' },
            { description: 'روز ملی روانشناس و مشاور' }
        ],
        10: [{ description: 'جشن چهلم نوروز؛ روز ملی خلیج فارس' }],
        11: [{ description: 'روز جهانی کارگر [ May 1 ]' }],
        12: [{ description: 'روز معلم' }],
        15: [
            { description: 'جشن میانه بهار/جشن بهاریه؛ روز شیراز' },
            { description: 'روز جهانی ماما [ May 5 ]' }
        ],
        18: [{ description: 'روز جهانی صلیب سرخ و هلال احمر [ May 8 ]' }],
        22: [
            { description: 'زادروز مریم میرزاخانی ریاضیدان ایرانی, روز جهانی زن در ریاضیات' },
            { description: 'روز جهانی پرستار [ May 12 ]' }
        ],
        25: [{ description: 'روز بزرگداشت فردوسی' }],
        27: [{ description: 'روز ارتباطات و روابط عمومی' }],
        28: [
            { description: 'روز بزرگداشت حکیم عمر خیام' },
            { description: 'روز جهانی موزه و میراث فرهنگی [ May 18 ]' },
            { description: 'شهادت امام محمد تقی (ع) [ ٣٠ ذوالقعده ]' }
        ],
    },
    'خرداد': {
        1: [
            { description: 'روز بهره وری و بهینه سازی مصرف' },
            { description: 'روز بزرگداشت ملاصدرا' }
        ],
        2: [{ description: 'فروریختن ساختمان متروپل در آبادان' }],
        3: [{ description: 'فتح خرمشهر در عملیات بیت المقدس و روز مقاومت, ایثار و پیروزی' }],
        4: [
            { description: 'شهادت امام محمد باقر (ع) [ ٧ ذوالحجه ]' },
            { description: 'روز دزفول، روز مقاومت و پایداری' }
        ],
        6: [
            { description: 'خرداد روز،جشن خردادگان' },
            { description: 'روز عرفه [ ٩ ذوالحجه ]' }
        ],
        7: [{ description: 'عید سعید قربان [ ١٠ ذوالحجه ]', isHoliday: true }],
        10: [{ description: 'روز جهانی بدون دخانیات [ May 31 ]' }],
        12: [{ description: 'ولادت امام علی النقی (ع) [ ١٥ ذوالحجه ]' }],
        14: [{ description: 'رحلت حضرت امام خمینی', isHoliday: true }],
        15: [
            { description: 'قیام ۱۵ خرداد', isHoliday: true },
            { description: 'روز جهانی محیط زیست [ June 5 ]' },
            { description: 'عید سعید غدیر خم [ ١٨ ذوالحجه ]', isHoliday: true }
        ],
        17: [{ description: 'ولادت امام موسی کاظم (ع) [ ٢٠ ذوالحجه ]' }],
        20: [{ description: 'روز جهانی صنایع دستی [ June 10 ]' }],
        22: [{ description: 'روز جهانی مبارزه با کار کودکان [ June 12 ]' }],
        24: [{ description: 'روز جهانی اهدای خون [ June 14 ]' }],
        25: [{ description: 'روز ملی گل وگیاه' }],
        26: [{ description: 'روز جهانی پدر [ June 16 ]' }],
        27: [{ description: 'روز جهانی بیابان زدایی [ June 17 ]' }],
        31: [{ description: 'سالروز زلزله رودبار و منجیل [۱۳۶۹ خورشیدی]' }]
    },
    'تیر': {
        1: [{ description: 'جشن آب پاشونک، جشن آغاز تابستان' }],
        4: [{ description: 'تاسوعای حسینی [ ٩ محرم ]', isHoliday: true }],
        5: [
            { description: 'روز جهانی مبارزه با مواد مخدر [ June 26 ]' },
            { description: 'عاشورای حسینی [ ١٠ محرم ]', isHoliday: true }
        ],
        7: [
            { description: 'انفجار دفتر حزب جمهوری اسلامی؛ روز قوه قضاییه' },
            { description: 'شهادت امام زین العابدین (ع) [ ١٢ محرم ]' }
        ],
        8: [{ description: 'روز مبارزه با سلاح های شیمیایی و میکروبی' }],
        10: [
            { description: 'روز صنعت و معدن' },
            { description: 'زادروز بابک خرمدین، سپه سالار دلاور ایران' },
            { description: 'روز بزرگداشت صائب تبریزی' }
        ],
        12: [{ description: 'شلیک به پرواز ۶۵۵ ایران ایر توسط ناو وینسنس [۱۳۶۷ خورشیدی]' }],
        13: [{ description: 'جشن تیرگان، بزرگداشت کمان کشیدن جان فدای ایران, آرش کمانگیر بر فراز البرز' }],
        14: [{ description: 'روز قلم' }],
        15: [{ description: 'جشن خام خواری' }],
        22: [{ description: 'زادروز محمد خوارزمی، ریاضیدان و فیلسوف ایرانی و روز ملی فناوری اطلاعات' }],
        25: [{ description: 'روز بهزیستی و تامین اجتماعی' }],
        27: [{ description: 'اعلام پذیرش قطعنامه ۵۹۸ شورای امنیت از سوی ایران [۱۳۶۷ خورشیدی]' }]
    },
    'آمرداد': {
        7: [{ description: 'اَمرداد روز،جشن اَمردادگان' }],
        8: [{ description: 'روز بزرگداشت شیخ شهاب الدین سهروردی' }],
        10: [
            { description: 'جشن چله تابستان' },
            { description: 'آغاز هفته جهانی شیردهی [ August 1 ]' }
        ],
        13: [{ description: 'اربعین حسینی [ ٢٠ صفر ]', isHoliday: true }],
        14: [{ description: 'سالروز صدور فرمان مشروطیت' }],
        17: [{ description: 'روز خبرنگار' }],
        21: [{ description: 'رحلت رسول اکرم؛شهادت امام حسن مجتبی (ع) [ ٢٨ صفر ]', isHoliday: true }],
        22: [{ description: 'روز جهانی چپ دست ها [ August 13 ]' }],
        23: [{ description: 'شهادت امام رضا (ع) [ ٣٠ صفر ]', isHoliday: true }],
        24: [{ description: 'هجرت پیامبر اکرم از مکه به مدینه [ ١ ربیع الاول ]' }],
        28: [
            { description: 'سالروز وقایع ۲۸ مرداد پس از برکناری محمد مصدق السلطنه' },
            { description: 'سالروز فاجعه آتش زدن سینما رکس آبادان' },
            { description: 'روز جهانی عکاسی [ August 19 ]' }
        ],
        31: [{ description: 'شهادت امام حسن عسکری (ع) [ ٨ ربیع الاول ]', isHoliday: true }]
    },
    'شهریور': {
        1: [{ description: 'روز بزرگداشت ابوعلی سینا و روز پزشک' }],
        2: [{ description: 'آغاز هفته دولت' }],
        4: [
            { description: 'زادروز کوروش بزرگ' },
            { description: 'شهریور روز،جشن شهریورگان' }
        ],
        5: [
            { description: 'میلاد رسول اکرم به روایت اهل سنت [ ١٢ ربیع الاول ]' },
            { description: 'روز بزرگداشت محمدبن زکریای رازی و روز داروساز' }
        ],
        8: [{ description: 'انفجار در دفتر نخست‌وزیری جمهوری اسلامی ایران، روز مبارزه با تروریسم' }],
        9: [{ description: 'میلاد رسول اکرم و امام جعفر صادق (ع) [ ١٧ ربیع الاول ]', isHoliday: true }],
        11: [{ description: 'روزصنعت چاپ' }],
        12: [{ description: 'سالروز شهادت رئیسعلی دلواری، سردار بزرگ میهن و فرمانده قیام جنوب علیه اشغالگران انگلیسی' }],
        13: [{ description: 'روز بزرگداشت ابوریحان بیرونی' }],
        19: [{ description: 'روز جهانی پیشگیری از خودکشی [ 10 September ]' }],
        20: [{ description: 'حمله به برج‌های دوقلوی مرکز تجارت جهانی [ 11 September ]' }],
        21: [{ description: 'روز سینما' }],
        27: [{ description: 'روز شعر و ادب پارسی و روز بزرگداشت استاد شهریار' }],
        29: [{ description: 'ولادت امام حسن عسکری (ع) [ ٨ ربیع الثانی ]' }],
        30: [{ description: 'روز جهانی صلح [ 21 September ]' }],
        31: [
            { description: 'آغاز هفته دفاع مقدس' },
            { description: 'وفات حضرت معصومه (س) [ ١٠ ربیع الثانی ]' }
        ]
    },
    'مهر': {
        1: [{ description: 'آغاز حمله مغول به ایران در پاییز ۵۹۸ خورشیدی' }],
        4: [{ description: 'روز گرامیداشت سربازان وطن' }],
        5: [{ description: 'روز جهانی جهانگردی [ September 27 ]' }],
        7: [
            { description: 'روز آتش نشانی و ایمنی' },
            { description: 'سقوط هواپیمای حامل جمعی از فرماندهان جنگ (کلاهدوز، نامجو، فلاحی، فکوری، جهان آرا) در سال ۱۳۶۰' },
            { description: 'روز بزرگداشت شمس تبریزی' }
        ],
        8: [
            { description: 'روز بزرگداشت مولوی' },
            { description: 'روز جهانی ناشنوایان [ September 30 ]' },
            { description: 'روز جهانی ترجمه و مترجم [ September 30 ]' },
            { description: 'ولادت امام حسن عسکری (ع) [ ۸ ربیع الثانی ]' }
        ],
        9: [{ description: 'روز جهانی سالمندان [ October 1 ]' }],
        10: [{ description: 'مهر روز،جشن مهرگان' }],
        11: [{ description: 'وفات حضرت معصومه (س) [ ۱۰ ربیع الثانی ]' }],
        12: [{ description: 'آغاز هفته جهانی فضا [ October 4 ]' }],
        13: [{ description: 'روز جهانی معلم [ October 5 ]' }],
        14: [{ description: 'روز دامپزشکی' }],
        16: [{ description: 'روز ملی کودک' }],
        17: [{ description: 'روز جهانی پست [ October 9 ]' }],
        18: [{ description: 'روز جهانی مبارزه با حکم اعدام [ October 10 ]' }],
        19: [{ description: 'روز جهانی دختر [ October 11 ]' }],
        20: [{ description: 'روز بزرگداشت حافظ' }],
        21: [{ description: 'روز پیروزی کاوه و فریدون بر ضحاک', isHoliday: true }],
        22: [{ description: 'روز جهانی استاندارد [ October 14 ]' }],
        23: [{ description: 'روز جهانی عصای سفید [ October 15 ]' }],
        24: [{ description: 'روز جهانی غذا [ October 16 ]' }],
        25: [{ description: 'روز جهانی ریشه کنی فقر [ October 17 ]' }],
        26: [{ description: 'روز تربیت بدنی و ورزش' }],
        28: [{ description: 'روز بزرگداشت یلغب به سردار ملی و از سرداران جنبش مشروطه ایران' }],
        29: [{ description: 'روز ملی کوهنورد' }]
    },
    'آبان': {
        1: [
            { description: 'روز آمار و برنامه ریزی' },
            { description: 'روز بزرگداشت ابوالفضل بیهقی، تاریخ‌نگار و نویسنده ایرانی' }
        ],
        5: [{ description: 'ولادت حضرت زینب (س) و روز پرستار و بهورز [ ۵ جمادی الاول ]' }],
        7: [{ description: 'سالروز ورود کوروش بزرگ به بابل در سال ۵۳۹ پیش از میلاد' }],
        10: [{ description: 'آبان روز، جشن آبانگان' }],
        13: [{ description: 'روز دانش آموز' }],
        14: [{ description: 'روز ملی مازندران' }],
        15: [{ description: 'آبان روز، جشن پاییز' }],
        18: [{ description: 'روز ملی کیفیت' }],
        23: [{ description: 'روز جهانی دیابت [ November 14 ]' }],
        24: [{ description: 'روز جهانی کتاب و کتابخوانی' }], // Note: Screenshot says 28, but it's usually 24. Going with screenshot data.
        28: [{ description: 'روز جهانی آقایان [ November 19 ]' }], // Note: Screenshot says 24, but it's 19. Going with screenshot data for day 28.
        29: [{ description: 'روز جهانی کودک [ November 20 ]' }]
    },
    'آذر': {
        1: [{ description: 'آذر جشن' }],
        3: [{ description: 'شهادت حضرت فاطمه زهرا (س) [ ۳ جمادی الثانیه ]', isHoliday: true }],
        4: [{ description: 'روز جهانی مبارزه با خشونت علیه زنان [ November 25 ]' }],
        5: [{ description: 'روز بسیج مستضعفان' }],
        7: [{ description: 'سالروز عملیات کربلای ۴ و روز نیروی دریایی' }],
        9: [{ description: 'آذر روز جشن آذرگان، آذر روز' }],
        10: [{ description: 'روز جهانی ایدز [ December 1 ]' }],
        12: [{ description: 'روز جهانی معلولان [ December 3 ]' }],
        13: [{ description: 'روز بیمه' }],
        15: [{ description: 'روز حسابدار' }],
        16: [{ description: 'روز دانشجو' }],
        19: [{ description: 'روز جهانی حقوق بشر [ December 10 ]' }],
        20: [
            { description: 'ولادت حضرت فاطمه زهرا (س) و روز مادر [ ۲۰ جمادی الثانیه ]' },
            { description: 'روز جهانی کوهستان [ December 11 ]' }
        ],
        21: [{ description: 'روز بزرگداشت آذربایجان' }],
        25: [{ description: 'روز پژوهش و فناوری' }],
        30: [{ description: 'شب یلدا، شب چله' }]
    },
    'دی': {
        1: [
            { description: 'روز میلاد خورشید؛ جشن خرم روز، نخستین جشن دیگان' },
            { description: 'ولادت امام محمد باقر (ع) [ ١ رجب ]' }
        ],
        3: [{ description: 'شهادت امام علی النقی (ع) [ ٣ رجب ]' }],
        4: [
            { description: 'جشن کریسمس [ December 25 ]' },
            { description: 'روز بزرگداشت دوستی [ December 25 ]' }
        ],
        5: [
            { description: 'زمین لرزه ی بم ۱۳۸۲ خورشیدی' },
            { description: 'سالروز شهادت اشو زرتشت، ابرانسان بزرگ تاریخ' },
            { description: 'سالروز عملیات کربلای ۴ [۱۳۶۵ خورشیدی]' }
        ],
        8: [
            { description: 'دی به آذر روز، دومین جشن دیگان' },
            { description: 'روز بزرگداشت یعقوب لیث صفاری (رادمان پورماهک) نخستین پادشاه ایرانی پس از اسلام' }
        ],
        9: [{ description: 'اعدام میهن‌پرستان آذری در تبریز توسط قوای اشغالگر روس [۱۲۹۰ خورشیدی]' }],
        10: [{ description: 'ولادت امام محمد تقی (ع) [ ۱۰ رجب ]' }],
        11: [{ description: 'جشن آغاز سال نو میلادی [ January 1 ]' }],
        13: [
            { description: 'ولادت امام علی (ع) و روز پدر [ ۱۳ رجب ]', isHoliday: true },
            { description: 'شهادت سردار حاج قاسم سلیمانی [۱۳۹۸ خورشیدی]' }
        ],
        15: [
            { description: 'دی به مهر روز، سومین جشن دیگان' },
            { description: 'وفات حضرت زینب (س) [ ۱۵ رجب ]' }
        ],
        16: [{ description: 'غرق شدن کشتی سانچی [۱۳۹۶ خورشیدی]' }],
        18: [{ description: 'شلیک به پرواز ۷۵۲ هواپیمایی اوکراین [۱۳۹۸ خورشیدی]' }],
        19: [{ description: 'درگذشت اکبر هاشمی رفسنجانی [۱۳۹۵ خورشیدی]' }],
        20: [{ description: 'قتل امیرکبیر به دستور ناصرالدین شاه قاجار [۱۲۳۰ خورشیدی]' }],
        23: [{ description: 'دی به دین روز، چهارمین جشن دیگان' }],
        25: [{ description: 'شهادت امام موسی کاظم (ع) [ ۲۵ رجب ]' }],
        27: [{ description: 'مبعث رسول اکرم (ص) [ ۲۷ رجب ]', isHoliday: true }],
        30: [{ description: 'آتش‌سوزی و فروریختن ساختمان پلاسکو [۱۳۹۵ خورشیدی]' }]
    },
    'بهمن': {
        1: [{ description: 'بهمن روز، جشن زادروز فردوسی' }],
        2: [{ description: 'بهمن روز، جشن بهمنگان' }],
        3: [{ description: 'ولادت امام حسین (ع) و روز پاسدار [ ٣ شعبان ]' }],
        4: [{ description: 'ولادت ابوالفضل العباس (ع) و روز جانباز [ ۴ شعبان ]' }],
        5: [
            { description: 'بهمن روز جشن نوسره' },
            { description: 'ولادت امام زین العابدین (ع) [ ۵ شعبان ]' }
        ],
        6: [{ description: 'بهمن‌روز، بزرگداشت صفی‌الدین اُرمَوی و روز موسیقی ایرانی' }],
        10: [{ description: 'بهمن جشن سده، گرامیداشت کشف آتش به دست هوشنگ شاه' }],
        11: [{ description: 'ولادت علی اکبر (ع) و روز جوان [ ١١ شعبان ]' }],
        12: [{ description: 'بهمن بازگشت امام خمینی (ره) به ایران' }],
        15: [{ description: 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان [ ۱۵ شعبان ]', isHoliday: true }],
        19: [{ description: 'بهمن روز نیروی هوایی' }],
        22: [
            { description: 'پیروزی انقلاب اسلامی', isHoliday: true },
            { description: 'بهمن حمله به سفارت روسیه و قتل گریبایدوف سفیر روسیه تزاری در ایران [ 11 February ]' }
        ],
        25: [{ description: 'بهمن جشن ولنتاین [ 14 February ]' }],
        29: [{ description: 'بهمن جشن سپندارمذگان و روز عشق' }]
    },
    'اسفند': {
        5: [
            { description: 'جشن سپندارمذگان و روز عشق' },
            { description: 'روز بزرگداشت خواجه نصیر الدین طوسی و روز مهندس' }
        ],
        7: [{ description: 'سالروز استقلال کانون وکلای دادگستری و روز وکیل مدافع' }],
        14: [{ description: 'ولادت امام حسن مجتبی (ع) [ ۱۵ رمضان ]' }],
        15: [{ description: 'روز درختکاری' }],
        17: [{ description: 'شب قدر [ ۱۸ رمضان ]' }],
        18: [{ description: 'ضربت خوردن حضرت علی (ع) [ ۱۹ رمضان ]' }],
        20: [{ description: 'شهادت حضرت علی (ع) [ ۲۱ رمضان ]', isHoliday: true }],
        21: [{ description: 'شب قدر [ ۲۲ رمضان ]' }],
        23: [{ description: 'روز جهانی عدد پی π [ March 14 ]' }],
        25: [
            { description: 'پایان سرایش شاهنامه' },
            { description: 'روز بزرگداشت اختر چرخ ادب، پروین اعتصامی' }
        ],
        29: [
            { description: 'روز ملی شدن صنعت نفت ایران', isHoliday: true },
            { description: 'روز جهانی شادی [ March 20 ]' }
        ]
    }
};
